Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs class provides the event arguments for a picked object.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs.HitPoint
Gets the hit point.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs.Objects
Gets the objects.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs.Faces
Gets the faces.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs.Segments
Gets the segments.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs.VisibleObjects
Gets the visible objects.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs.IsValid
Gets or set s a value indicating whether the new pick is valid.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs.#ctor(Tekla.Common.Geometry.Vector3,System.Collections.Generic.IEnumerable{Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedObject},System.Collections.Generic.IEnumerable{Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace},System.Collections.Generic.IEnumerable{Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine})
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs class.
hitPoint: The hit point.
objects: The objects.
faces: The faces.
segments: The segments.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs.#ctor(Tekla.BIM.DirectManipulation.Services.Picking.PickEventArgs)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs class.
eventArgs: The Tekla.BIM.DirectManipulation.Services.Picking.PickEventArgs instance containing the event data.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs.#ctor(Tekla.BIM.DirectManipulation.Services.Toleration.TolerationChangedEventArgs)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs class.
eventArgs: The Tekla.BIM.DirectManipulation.Services.Toleration.TolerationChangedEventArgs instance containing the event data.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs.#ctor(Tekla.BIM.DirectManipulation.Services.Picking.PickPointResolveEventArgs)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.ToleratedObjectEventArgs class.
eventArgs: The Tekla.BIM.DirectManipulation.Services.Picking.PickPointResolveEventArgs instance containing the event data.